# GroupedModelElemHasViewSpecificSubordinates Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..GroupedModelElemHasViewSpecificSubordinates Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to group the selected elements. Model element in group has view specific subordinates or view specific element in group has non-view specific subordinates.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GroupedModelElemHasViewSpecificSubordinates { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GroupedModelElemHasViewSpecificSubordinates As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GroupedModelElemHasViewSpecificSubordinates {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace